# ---***---   coding:utf-8   ---***---

"列表部分作业"

"""
列表习题：

一 下面列表：

a = [1,2,3,4,5,333,11,44]

输出下面的结果：

[4,5,333]

二 有下面2个列表

a = [1,2,3]
b = [4,5,6]

用2个方法输出下面结果：

[1,2,3,4,5,6]


三 有下面2个列表：

a = [1,99,33,44,55,22]

输出结果:

1：[1,2,99,33,44,55,22,(11,33,54)]

2: [1,2,99,33,101,44,55,22]


四：用列表推导式生成100内的大于20的偶数



"""

"""
列表习题：

一 下面列表：

a = [1,2,3,4,5,333,11,44]

输出下面的结果：

[4,5,333]
"""
a = [1,2,3,4,5,333,11,44]

print(a[3:6])


"""
二 有下面2个列表

a = [1,2,3]
b = [4,5,6]

用2个方法输出下面结果：

[1,2,3,4,5,6]



"""
a = [1,2,3]
b = [4,5,6]

print(a+b)

#方法一
a.extend(b)
print(a)
#方法二
a = [1,2,3]
b = [4,5,6]
a.append(b)
print(a)

a = [1,2,3]
b = [4,5,6]
a.insert(len(a),b)
print(a)


"""
三 有下面2个列表：

a = [1,99,33,44,55,22]

输出结果:

1：[1,2,99,33,44,55,22,(11,33,54)]

2: [1,2,99,33,101,44,55,22]
"""
a = [1,99,33,44,55,22]
b = [11,33,54]

a.insert(1,2)
a.insert(len(a),b)
print(a)
a = [1,99,33,44,55,22]
a.insert(1,2)
a.insert(4,101)
print(a)


"""
四：用列表推导式生成100内的大于20的偶数
"""
print([x for x in range(1,100) if (x > 20 and x % 2  == 0)])